[{"UID":"418","abstract":"Olaf is a portable, landmark-based, acoustic fingerprint-ing system released as open source software. Olaf runs on embedded platforms, traditional computers and in the browser. Olaf is able to extract fingerprints from an audio stream, and either store those fingerprints in a database, or find a match between extracted fingerprints and stored fingerprints. It implements an algorithm similar to the one described in a classic ISMIR paper and has similar retrieval performance. It facilitates the many use cases acoustic fingerprinting has to offer such as duplicate detection, meta-data coupling, and synchronization.","affiliations":"University Ghent - IPEM","author_emails":"['joren.six@ugent.be']","authors":"Joren Six","bilibili_id":"BV1oZ4y157ER","channel_name":"lbd-8-418-six","channel_url":"https://ismir2020.slack.com/archives/C01CR4BSZLZ","poster_type":"html","primary_author":"Joren Six","primary_email":"joren.six@ugent.be","session":"8","title":"OLAF: Overly Lightweight Acoustic Fingerprinting","youtube_id":"wP29RaQicwE"},{"UID":"419","abstract":"Beat processing is a critical component of how humans experience music and a core topic in Music Information Retrieval (MIR). In this study we investigate relationships between computational features and human perception using real-world music spanning a variety of rhythmic categories. We observe a significant relationship between pulse clarity computed from the audio and inter-subject correlation of the neural responses. This finding suggests promising future lines of investigation integrating MIR audio features, neural correlation, and subjective behavioral reports in understanding beat processing and representation.","affiliations":"Southern Methodist University, Dallas, Texas USA|City College of New York|Stanford University","author_emails":"['jay.appaji@gmail.com', 'dmochowski@gmail.com', 'blairbo@ccrma.stanford.edu']","authors":"Jay Appaji|Jacek Dmochowski|Blair Kaneshiro","bilibili_id":"","channel_name":"lbd-7-419-appaji","channel_url":"https://ismir2020.slack.com/archives/C01C5PFTHPY","poster_type":"pdf","primary_author":"Jay Appaji","primary_email":"jay.appaji@gmail.com","session":"7","title":"Modelling Perception of Rhythmic Complexity: Computational and Neural Measures","youtube_id":""},{"UID":"420","abstract":"In order to study performance characteristics of untrained, amateur singers, we developed an online tool through which coders could evaluate real-world vocal performances of “Amazing Grace” from a Smule dataset. Coders from Stanford University used the online evaluation tool to deliver judgments of age and gender of the performers, as well as skill, likeability, and expressiveness of the vocal performances. Initial results show subjective evaluations of skill, likeability, and expressiveness are highly correlated, and coders rarely gave the highest possible score in any of the three metrics. This online evaluation tool can be used in future computational studies of vocal performance.","affiliations":"Stanford University|Stanford University|Stanford University|Stanford University|Stanford University","author_emails":"['egeorgie@ccrma.stanford.edu', 'cnoufi@ccrma.stanford.edu', 'vidya@ccrma.stanford.edu', 'blairbo@ccrma.stanford.edu', 'brg@ccrma.stanford.edu']","authors":"Elena Georgieva|Camille Noufi|Vidya Rangasayee|Blair Kaneshiro|Jonathan Berger","bilibili_id":"","channel_name":"lbd-8-420-georgieva","channel_url":"https://ismir2020.slack.com/archives/C01CR4Q0BS5","poster_type":"pdf","primary_author":"Elena Georgieva","primary_email":"egeorgie@ccrma.stanford.edu","session":"8","title":"An Evaluation Tool for Subjective Evaluation of Amateur Vocal Performances of “Amazing Grace”","youtube_id":""},{"UID":"421","abstract":"In this late-breaking abstract we propose a modified approach for beat tracking evaluation which poses the problem in terms of the effort required to transform a sequence of beat detections such that they maximise the well-known F-measure calculation when compared to a sequence of ground truth annotations. Central to our approach is the inclusion of a shifting operation conducted over an additional, larger, tolerance window, which can substitute the combination of insertions and deletions. We describe a straightforward calculation of annotation efficiency and combine this with an informative visualisation which can be of use for the qualitative evaluation of beat tracking systems. We make our implementation and visualisation code freely available in a GitHub repository.","affiliations":"Universidade do Porto|ISEC|CISUC - Centre for Informatics and Systems of the University of Coimbra","author_emails":"['antoniosapinto@gmail.com', 'inesdomingues@gmail.com', 'mepdavies@dei.uc.pt']","authors":"António Pinto|Ines Domingues|Matthew Davies","bilibili_id":"","channel_name":"lbd-8-421-pinto","channel_url":"https://ismir2020.slack.com/archives/C01C9CZMC3F","poster_type":"pdf","primary_author":"António Pinto","primary_email":"antoniosapinto@gmail.com","session":"8","title":"Shift If You Can: Counting and Visualising Correction Operations for Beat Tracking Evaluation","youtube_id":""},{"UID":"422","abstract":"We introduce rolypoly~, the first drum machine for live performance that adapts its microtiming in relation to a human musician. We leverage state-of-the-art work in expressive performance modelling with recurrent nets, towards real-time application on the micro scale. Our models are pretrained on the Groove MIDI Dataset from Magenta, and then fine-tuned iteratively over several duet performances of a new piece. We propose a method for defining training targets based on previous performances, rather than a prior ground truth. The agent is able to adapt to human timing nuances, and can achieve effects such as morphing a rhythm from straight to swing.","affiliations":"UNATC","author_emails":"['gburloiu@gmail.com']","authors":"Grigore Burloiu","bilibili_id":"BV1XZ4y157Dt","channel_name":"lbd-8-422-burloiu","channel_url":"https://ismir2020.slack.com/archives/C01CCFLEDS6","poster_type":"pdf","primary_author":"Grigore Burloiu","primary_email":"gburloiu@gmail.com","session":"8","title":"Adaptive Drum Machine Microtiming with Transfer Learning and RNNs","youtube_id":"zUICIHncfXE"},{"UID":"423","abstract":"We propose the Multi-Track Music Machine (MMM), a generative system based on the Transformer architecture that is capable of generating multi-track music. In contrast to previous work, which represents musical material as a single time-ordered sequence, where the musical events corresponding to different tracks are interleaved, we create a time-ordered sequence of musical events for each track and concatenate several tracks into a single sequence. This takes advantage of the Transformer's attention-mechanism, which can adeptly handle long-term dependencies. We explore how various representations can offer the user a high degree of control at generation time, providing an interactive demo that accommodates track-level and bar-level inpainting, and offers control over track instrumentation and note density.","affiliations":"Simon Fraser University|Simon Fraser University","author_emails":"['jeffe@sfu.ca', 'pasquier@sfu.ca']","authors":"Jeffrey Ens|Philippe Pasquier","bilibili_id":"BV1M54y127yZ","channel_name":"lbd-7-423-ens","channel_url":"https://ismir2020.slack.com/archives/C01CCFLEKLJ","poster_type":"pdf","primary_author":"Jeffrey Ens","primary_email":"jeffe@sfu.ca","session":"7","title":"Flexible Generation with the Multi-track Music Machine","youtube_id":"_tDGv6zBrVg"},{"UID":"424","abstract":"Choirs aim at blending the voices of different choral parts together in order to create a cohesive whole. Reaching this goal requires significant time and effort spent in rehearsals. Since joint rehearsal time is limited, amateur choir singers often practice their parts individually (e.g., at home) before the rehearsal. Over the last years, applications have become popular that offer sing-along and score following functionalities for individual rehearsals. In this work, we present a web-based interface with intonation feedback mechanism for choir rehearsal preparation. The interface combines several open-source tools that have been developed by the MIR community.","affiliations":"International Audio Laboratories Erlangen|International Audio Laboratories Erlangen|Carus-Verlag GmbH & Co. KG|International Audio Laboratories Erlangen","author_emails":"['sebastian.rosenzweig@audiolabs-erlangen.de', 'lukas@dietzens.net', 'jgraulich@carus-verlag.com', 'meinard.mueller@audiolabs-erlangen.de']","authors":"Sebastian Rosenzweig|Lukas Dietz|Johannes Graulich|Meinard Müller","bilibili_id":"","channel_name":"lbd-8-424-rosenzweig","channel_url":"https://ismir2020.slack.com/archives/C01C9CZMSDT","poster_type":"pdf","primary_author":"Sebastian Rosenzweig","primary_email":"sebastian.rosenzweig@audiolabs-erlangen.de","session":"8","title":"TuneIn: a Web-based Interface for Practicing Choral Parts","youtube_id":""},{"UID":"425","abstract":"We explore the task of predicting artist origin (hometown, current city of residence) based on their past live music events, using a heuristic approach; specifically, by calculating the proportion of the artist’s events that are located near the city where the artist performs most frequently.","affiliations":"Cornell University|Ithaca College|Cornell","author_emails":"['mgz27@cornell.edu', 'dturnbull@ithaca.edu', 'tj@cs.cornell.edu']","authors":"Michael G Zhou|Douglas Turnbull|Thorsten Joachims","bilibili_id":"BV1it4y1v7up","channel_name":"lbd-8-425-zhou","channel_url":"https://ismir2020.slack.com/archives/C01CJLC3WTW","poster_type":"pdf","primary_author":"Michael G Zhou","primary_email":"mgz27@cornell.edu","session":"8","title":"Can We Determine Artist Origin from Past Live Events?","youtube_id":"OpqFuyO_ews"},{"UID":"426","abstract":"The present study introduces a mathematical model for the symmetric phrasing scheme of German musicologist Hugo Riemann (1849–1919). The model is used to create an artificially expressive timing pattern in Max Reger’s (1873¬–1916) organ Prelude op. 135a/1 and is evaluated analytically against professional human interpretation.","affiliations":"McGill University, CIRMMT|McGill University","author_emails":"['yulia.draginda@mail.mcgill.ca', 'ichiro.fujinaga@mcgill.ca']","authors":"Yulia Draginda|Ichiro Fujinaga","bilibili_id":"BV1ot4y1v7Kd","channel_name":"lbd-7-426-draginda","channel_url":"https://ismir2020.slack.com/archives/C01CCMPQCE7","poster_type":"pdf","primary_author":"Yulia Draginda","primary_email":"yulia.draginda@mail.mcgill.ca","session":"7","title":"First Steps Towards Modelling Expressive Timing in German Late Romantic Organ Music","youtube_id":"08WBIMDB8cY"},{"UID":"427","abstract":"The topic of Music Emotion Recognition (MER) evolved as music is a fascinating expression of emotions, yet it faces challenges given its subjectivity. Because each language has its particularities in terms of sound and intonation, and implicitly associations made upon them, we hypothesize perceived emotions might vary in different cultures. To address this issue, we test a novel approach towards emotion detection and propose a language sensitive end-to-end model that learns to tag emotions from music with lyrics in English, Mandarin and Turkish.","affiliations":"Universitat Pompeu Fabra|Universitat Pompeu Fabra|Universitat Pompeu Fabra","author_emails":"['ana.gabriela.pandrea@gmail.com', 'juansebastian.gomez@upf.edu', 'perfecto.herrera@upf.edu']","authors":"Ana Gabriela Pandrea|Juan S. Gómez-Cañón|Perfecto Herrera","bilibili_id":"","channel_name":"lbd-8-427-pandrea","channel_url":"https://ismir2020.slack.com/archives/C01CR4Q1G0Z","poster_type":"pdf","primary_author":"Ana Gabriela Pandrea","primary_email":"ana.gabriela.pandrea@gmail.com","session":"8","title":"Cross-dataset Music Emotion Recognition: an End-to-end Approach","youtube_id":""},{"UID":"428","abstract":"In this paper, we introduce a simple method that can separate arbitrary musical instruments from an audio mixture. Given an unaligned MIDI transcription for a target instrument from an input mixture, we synthesize new mixtures from the midi transcription that sound similar to the mixture to be separated. This lets us create a labeled training set to train a network on the specific bespoke task. When this model applied to the original mixture, we demonstrate that this method can: 1) successfully separate out the desired instrument with access to only unaligned MIDI, 2) separate arbitrary instruments, and 3) get results in a fraction of the time of existing methods. We encourage readers to listen to the demos posted here: https://git.io/JUu5q.","affiliations":"Northwestern University|Northwestern University","author_emails":"['ethanmanilow@gmail.com', 'pardo@northwestern.edu']","authors":"Ethan Manilow|Bryan Pardo","bilibili_id":"","channel_name":"lbd-7-428-manilow","channel_url":"https://ismir2020.slack.com/archives/C01D2AZCJSC","poster_type":"pdf","primary_author":"Ethan Manilow","primary_email":"ethanmanilow@gmail.com","session":"7","title":"Bespoke Neural Networks for Score-informed Source Separation","youtube_id":""},{"UID":"429","abstract":"Singing Voice Detection still have place in Music Information Retrieval research, particularly with the new possibilities generated by feature learning for music content recognition. VGGish embeddings are general purpose audio features that can be used as audio descriptors for multiple tasks. We make a performance comparison of singing voice detectors using vocal VGGish embeddings and vocal perceptually-motivated features. For that end, we train Random Forest models using perceptually inspired features (MFCC, Fluctogram, Vocal Variance) and VGGish embeddings. Our results show that VGGish embeddings have classification performance metrics at least comparable to perceptually-motivated features.","affiliations":"USP","author_emails":"['shayenne.moura@usp.br']","authors":"Shayenne Moura","bilibili_id":"","channel_name":"lbd-7-429-moura","channel_url":"https://ismir2020.slack.com/archives/C01C9CZNKJ9","poster_type":"pdf","primary_author":"Shayenne Moura","primary_email":"shayenne.moura@usp.br","session":"7","title":"Comparison of VGGish Embeddings and Perceptually-motivated Features for Singing Voice Detection","youtube_id":""},{"UID":"430","abstract":"In this demo, we present Mixonset, a consumer iOS app for automatic DJ mixing and music discovery. Mixonset lets users create DJ-style music mixes from their playlists by organizing them, adding recommendations, and creat-ing transitions between each song. It also allows users to mix the highlight part of each song, filter playlists based on various music features, as well as controlling the amount of recommended songs added to the playlist.","affiliations":"Mixonset","author_emails":"['zeyu@mixonset.com']","authors":"Zeyu Li","bilibili_id":"","channel_name":"lbd-7-430-li","channel_url":"https://ismir2020.slack.com/archives/C01D2AZCRJL","poster_type":"pdf","primary_author":"Zeyu Li","primary_email":"zeyu@mixonset.com","session":"7","title":"Mixonset App: Consumer Application for Automatic DJ Mixing and Music Discovery","youtube_id":""},{"UID":"431","abstract":"In this study, we train deep neural networks to classify composer on a symbolic domain. The model takes a two-channel two-dimensional input, i.e., onset and note activations of time-pitch representation, which is converted from MIDI recordings and performs a single-label classification. On the experiments conducted on MAESTRO dataset, we report an F1 value of 0.8333 for the classification of 13~classical composers.","affiliations":"Yonsei University|Yonsei University|Yonsei University|Spotify|Yonsei University","author_emails":"['hylee817@gmail.com', 'hahala25@yonsei.ac.kr', 'ryan0507@yonsei.ac.kr', 'gnuchoi@gmail.com', 'leejinho@yonsei.ac.kr']","authors":"Hye Yoon Lee|Sunghyeon Kim|SunJong Park|Keunwoo Choi|Jinho Lee","bilibili_id":"","channel_name":"lbd-7-431-lee","channel_url":"https://ismir2020.slack.com/archives/C01CR4Q29J5","poster_type":"pdf","primary_author":"Jinho Lee","primary_email":"leejinho@yonsei.ac.kr","session":"7","title":"Deep Composer Classification Using Symbolic Representation","youtube_id":""},{"UID":"432","abstract":"In this paper, we introduce a technique for generating large collections of artificial training examples, which can be used to train chord labeling, key detection, and roman numeral analysis models. The technique consists of using roman numeral analysis annotations of existing datasets to generate harmonic reductions of the chords implied by the original annotations. The artificially generated examples ignore the original notes of the annotated example (i.e., the specific \"voicings\" of the chords), replacing them with voicings suggested by a rule-based voice leading algorithm. A relatively large number of artificial examples can be generated from a single annotated progression using this technique. For example, 10 different voicings in 12 different keys would result in 120 artificial examples generated out of one annotated chord progression. The voicings suggested for different keys do not necessarily overlap, given that the range of the voices and other variables are taken into account by the rule-based algorithm. This results in data augmentation with potentially unique voicings in each key, contrary to what would be obtained by simply transposing the artificial examples to a different key. We show the process of applying this technique to a dataset of annotated Bach chorales from the KernScores website. Similar datasets with roman numeral analysis annotations could be used with this approach to generate a large number of artificial training examples for training machine learning models.","affiliations":"McGill University, CIRMMT|McGill University","author_emails":"['nestor.napoleslopez@mail.mcgill.ca', 'ichiro.fujinaga@mcgill.ca']","authors":"Néstor Nápoles López|Ichiro Fujinaga","bilibili_id":"","channel_name":"lbd-7-432-nápoles-lópez","channel_url":"https://ismir2020.slack.com/archives/C01CCMPREUB","poster_type":"pdf","primary_author":"Néstor Nápoles López","primary_email":"nestor.napoleslopez@mail.mcgill.ca","session":"7","title":"Harmonic Reductions As a Strategy for Creative Data Augmentation","youtube_id":""},{"UID":"433","abstract":"The global music market moves billions of dollars every year, most of which comes from streaming platforms. In this paper, I present a model for predicting whether or not a song will appear in Spotify's Top 50 ranking. To make this prediction, I trained different classifiers with information of audio features from songs that appeared in this ranking between November 2018 and January 2019. When tested with data from June and July 2019, an SVM classifier with RBF kernel obtained accuracy and AUC above 80%.","affiliations":"Loggi","author_emails":"['vicente@icomp.ufam.edu.br']","authors":"Carlos V Soares Araujo","bilibili_id":"","channel_name":"lbd-7-433-araujo","channel_url":"https://ismir2020.slack.com/archives/C01CCFLGC66","poster_type":"pdf","primary_author":"Carlos V Soares Araujo","primary_email":"vicente@icomp.ufam.edu.br","session":"7","title":"A Model for Predicting Music Popularity on Spotify","youtube_id":""},{"UID":"434","abstract":"Time-scale modification (TSM) is a digital audio effect that adjusts the length of an audio signal while preserving its pitch. The TSM audio effect is widely used in not only sound production but also music and audio research such as for data augmentation. In this paper, we present PyTSMod, an open-source Python library that implements several different classical TSM algorithms. We expect that PyTSMod can help MIR and audio researchers easily use the TSM algorithms in the Python-based environment.","affiliations":"KAIST|KAIST|KAIST","author_emails":"['koragon2@kaist.ac.kr', 'cjb3549@kaist.ac.kr', 'juhan.nam@kaist.ac.kr']","authors":"Sangeon Yong|Soonbeom Choi|Juhan Nam","bilibili_id":"BV1fk4y1C7Yu","channel_name":"lbd-7-434-yong","channel_url":"https://ismir2020.slack.com/archives/C01D2AZDLKA","poster_type":"html","primary_author":"Sangeon Yong","primary_email":"koragon2@kaist.ac.kr","session":"7","title":"PyTSMod: a Python Implementation of Time-scale Modification Algorithms","youtube_id":"AhBQ8boYv_I"},{"UID":"435","abstract":"We introduce the Children's Song Dataset (CSD) which contains vocal recordings for 100 children's songs sung in Korean or English and are temporally aligned with the MIDI transcriptions and lyrics annotations. We expect that the dataset can be useful for various singing voice analysis and synthesis tasks.","affiliations":"Korea Advanced Institute of Science and Technology","author_emails":"['cjb3549@gmail.com']","authors":"Soonbeom Choi","bilibili_id":"","channel_name":"lbd-7-435-choi","channel_url":"https://ismir2020.slack.com/archives/C01CR4Q2RMX","poster_type":"html","primary_author":"Soonbeom Choi","primary_email":"cjb3549@gmail.com","session":"7","title":"Children’s Song Dataset for Singing Voice Research","youtube_id":""},{"UID":"436","abstract":"We benchmark here several convolution kernels, particulary trying custom dilated convolutions, and show how convolutions following pitch spaces such as the Tonnetz may help the learning of musical tasks.","affiliations":"Université de Lille|CNRS, Université de Lille|Université de Lille","author_emails":"['rony.abecidan.etu@univ-lille.fr', 'mathieu.giraud@univ-lille.fr', 'gianluca.micchi@algomus.fr']","authors":"Rony Abecidan|Mathieu Giraud|Gianluca Micchi","bilibili_id":"","channel_name":"lbd-8-436-giraud","channel_url":"https://ismir2020.slack.com/archives/C01D2AZDV40","poster_type":"pdf","primary_author":"Mathieu Giraud","primary_email":"mathieu.giraud@univ-lille.fr","session":"8","title":"Towards Custom Dilated Convolutions on Pitch Spaces","youtube_id":""},{"UID":"437","abstract":"Hierarchical and reductive analyses are central methods for music modeling and anaysis. However, to this day, no dedicated software exists to support analysts with this task. Here, we present a prototype of a generic tool for hierarchical analysis of scores in the Music Encoding Initiative (MEI) format. We use the rendering engine Verovio to render an MEI XML structure to a Scalable Vector Graphics (SVG) which is presented to the user. By selecting and manipulating the SVG elements using the tool, we add hierarchical analysis metadata to the MEI following the scheme proposed by Rizo and Marsden. We hope this tool will support professionals in performing hierarchical music annotations as well as find use in educational contexts.","affiliations":"EPFL|Ecole Polytechnique Fédérale de Lausanne","author_emails":"['petter.ericson@epfl.ch', 'martin.rohrmeier@epfl.ch']","authors":"Petter Ericson|Martin Rohrmeier","bilibili_id":"","channel_name":"lbd-8-437-ericson","channel_url":"https://ismir2020.slack.com/archives/C01C5PHNSNS","poster_type":"pdf","primary_author":"Petter Ericson","primary_email":"petter.ericson@epfl.ch","session":"8","title":"Hierarchical Annotation of MEI-encoded Sheet Music","youtube_id":""},{"UID":"438","abstract":"To date, most research in automatic musical structure analysis and segmentation from audio has been con-ducted using established audio features with boundary detection and clustering methods. In other Music IR tasks, we have seen significant advances in performance using deep learning, specifically convolutional neural networks -- networks pioneered in image understanding problems. Several experiments have examined the “images” of musical self-similarity, computed from acoustic features, which can provide a compelling visual representation of overall musical structure, but remain difficult to automatically interpret. In a recent trial, we directly trained and applied a robust visual object detection network on layered self-similarity matrices to identify musical segments (intro, verse, chorus) of a song, and highlight them using bounding boxes as done in visual object detection. We performed an initial assessment of this task using an “off-the-shelf” implementation, Facebook AI Research’s Detectron2, of the Faster R-CNN recognition method on SSMs generated using audio features as separate “color channels”. Preliminary results of the system and general knowledge of this task provide some indications that visual object detection methods examining the entire SSM may allow us to characterize musical sections and reveal indicative features identifying different segments.","affiliations":"Drexel University|Drexel University","author_emails":"['cnu25@drexel.edu', 'ykim@drexel.edu']","authors":"Christopher N Uzokwe|Youngmoo Kim","bilibili_id":"","channel_name":"lbd-7-438-uzokwe","channel_url":"https://ismir2020.slack.com/archives/C01BXP8HUS3","poster_type":"pdf","primary_author":"Christopher N Uzokwe","primary_email":"cnu25@drexel.edu","session":"7","title":"Musical Structure Analysis Using Image Segmentation Networks","youtube_id":""},{"UID":"439","abstract":"We present the integration of various CNN TensorFlow models developed for different MIR tasks into Essentia. This is a continuation of our previous work, extending the list of supported models and adding new algorithms to facilitate usability. Essentia provides input feature extraction and inference with TensorFlow models in a single C++ pipeline with Python bindings, the overhead of Python bindings and facilitating the deployment of C++ and Python MIR applications. We assess the new models' capabilities to serve as embedding extractors in many downstream classification tasks. All presented models are publicly available on the Essentia website.","affiliations":"Universitat Pompeu Fabra|Universitat Pompeu Fabra|Universitat Pompeu Fabra ","author_emails":"['pablo.alonso@upf.edu', 'dmitry.bogdanov@upf.edu', 'xavier.serra@upf.edu']","authors":"Pablo Alonso-Jiménez|Dmitry Bogdanov|Xavier Serra","bilibili_id":"BV1Wi4y1j7VW/","channel_name":"lbd-8-439-alonso-jiménez","channel_url":"https://ismir2020.slack.com/archives/C01BXP8HZ6K","poster_type":"pdf","primary_author":"Pablo Alonso-Jiménez","primary_email":"pablo.alonso@upf.edu","session":"8","title":"Deep Embeddings with Essentia Models","youtube_id":"hzaCpiudF3c"},{"UID":"440","abstract":"We introduce a deep neural network design for the unsupervised pitch estimation of acoustic guitar chords. The proposed system takes in a short audio clip containing a guitar chord or note and produces estimates for the pitches present and their amplitudes. It trains without requiring labeled data. In an analysis part of the network, a convolutional neural network produces pitch estimates from an input spectrogram. These pitch estimates are fed into a synthesis part that attempts to reconstruct the original input. The analyzer trains while the synthesizer remains fixed, and a reconstruction loss is minimized. As the network improves its reconstructions, it learns to produce accurate pitch estimates. We discuss two variants for the synthesis part: component note synthesis and Karplus-Strong synthesis. We hope that insights from this work can be integrated into a full network for unsupervised acoustic guitar transcription.","affiliations":"Drexel University|Drexel University","author_emails":"['awiggins@drexel.edu', 'ykim@drexel.edu']","authors":"Andrew F Wiggins|Youngmoo Kim","bilibili_id":"","channel_name":"lbd-7-440-wiggins","channel_url":"https://ismir2020.slack.com/archives/C01BXP8J3NK","poster_type":"pdf","primary_author":"Andrew F Wiggins","primary_email":"awiggins@drexel.edu","session":"7","title":"Towards Unsupervised Acoustic Guitar Transcription","youtube_id":""},{"UID":"441","abstract":"We present a visualization tool for Convolutional Neural Networks focused on the task of instrument recognition. This tool allows you to visualize the network response layer by layer to a specific input sample as an array of animated activation plots corresponding to nodes, or filters, in the network. The recognition of instruments from audio, particularly in ensemble mixtures, remains a challenging and important problem fundamental to the field of music information retrieval. Early solutions to this problem focused heavily on designing task specific input features. These features were very well defined, however, their performance does not come close to state-of-the-art deep learning approaches such as convolutional neural networks, multi-task approaches, and transfer learning. However, the reported results of these black-box networks generally focus on overall performance across a dataset and ignore underlying instrument class performance disparities, which may overlook deeper issues with these approaches. Recently these types of deep learning approaches have become de facto standards for solving a wide variety of problems in the field of MIR. Still the underlying feature representations learned by these networks are not well understood in deep learning problems at large and even less in audio and spectrogram input specific cases. Our goal is to apply deep network and CNN analysis tools to the problem of predominant instrument recognition and create an analysis tool widely applicable and useful for MIR specific deep learning models.","affiliations":"Drexel University|Drexel University","author_emails":"['crc356@drexel.edu', 'ykim@drexel.edu']","authors":"Charis Cochran|Youngmoo Kim","bilibili_id":"BV1zt4y1v7Sb","channel_name":"lbd-7-441-cochran","channel_url":"https://ismir2020.slack.com/archives/C01CCMPSK4K","poster_type":"pdf","primary_author":"Charis Cochran","primary_email":"crc356@drexel.edu","session":"7","title":"Visualization of Deep Networks for Musical Instrument Recognition","youtube_id":"DyLMOSfd8OI"},{"UID":"442","abstract":"We introduce a new algorithm to quantify the \"helicality\" between frequency sub-bands in an audio dataset using an isomap-based measure.","affiliations":"New York University|Cornell Lab of Ornithology","author_emails":"['sripathi.sridhar@nyu.edu', 'vincent.lostanlen@nyu.edu']","authors":"Sripathi Sridhar|Vincent Lostanlen","bilibili_id":"BV1h54y1R7rX","channel_name":"lbd-7-442-sridhar","channel_url":"https://ismir2020.slack.com/archives/C01BXP8JB8F","poster_type":"pdf","primary_author":"Sripathi Sridhar","primary_email":"sripathi.sridhar@nyu.edu","session":"7","title":"Helicality: an Isomap-based Measure of Octave Equivalence in Audio Data","youtube_id":"76ukCoKg4_k"},{"UID":"443","abstract":"Identification and availability of suitable data sources is a well-known difficulty in music information retrieval research. For studies requiring annotated data, this can be compounded by inconsistent presentation formats, differences in methodologies, and annotation errors. By building a framework to apply automated data cleansing and standardization techniques to a collection of MIREX evaluation output data, I was able to extract a large, labelled chord data set for use in a harmonic modelling study.","affiliations":"Queen Mary University of London|Queen Mary University of London|Queen Mary University of London","author_emails":"['j.k.miller@qmul.ac.uk', 'j.pauwels@qmul.ac.uk', 'mark.sandler@qmul.ac.uk']","authors":"Jeffrey K Miller|Johan Pauwels|Mark Sandler","bilibili_id":"","channel_name":"lbd-8-443-miller","channel_url":"https://ismir2020.slack.com/archives/C01CCMPSRTM","poster_type":"pdf","primary_author":"Jeffrey K Miller","primary_email":"j.k.miller@qmul.ac.uk","session":"8","title":"A Data-cleansing Framework for Aggregating Annotated Datasets from MIREX Automated Chord Estimation Archives","youtube_id":""},{"UID":"444","abstract":"Research in automatic music transcription (AMT) showed significant improvement thanks to advances in deep learning. However, most of the research was designed for an offline scenario, where the input audio recording is provided from beginning to end. In this paper, we present an online piano AMT system with visualization using a web browser and MIDI export which works on CPU in real-time. We employed a model with auto-regressive LSTM and multi-note-state, which is adapted for an online scenario without losing its accuracy.","affiliations":"SK Telecom","author_emails":"['dasaem.jeong@sktbrain.com']","authors":"Dasaem Jeong","bilibili_id":"BV1q541157Un","channel_name":"lbd-7-444-jeong","channel_url":"https://ismir2020.slack.com/archives/C01CR4Q3V7B","poster_type":"pdf","primary_author":"Dasaem Jeong","primary_email":"dasaem.jeong@sktbrain.com","session":"7","title":"Real-time Automatic Piano Music Transcription System","youtube_id":"ofaafYKJ5lA"}]
